Reports/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>Продажи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереключательРежим</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КомплектующиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КомплектующиеНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплектующая</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаКомплектующей</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/Продажи/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

Функция ПолучитьТаблицуРезервов()
	
	ТипЦенМелкийОпт = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000014");
	ТипКомплект     = Перечисления.ТипыНоменклатуры.Комплект;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Дата КАК Дата,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Организация КАК Организация,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Контрагент КАК Контрагент,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Контрагент.Регион КАК Регион,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Подразделение КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.НК КАК НК,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток * ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток * ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕд,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ТипЦен КАК ТипЦен,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК Единица,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ВалютаДокумента КАК Валюта,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.КурсВзаиморасчетов КАК Курс,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.КратностьВзаиморасчетов КАК Кратность,
		|	0 КАК Сумма,
		|	0 КАК СуммаБезСкидок,
		|	0 КАК СуммаСкидки
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаКон, ) КАК ТоварыВРезервеНаСкладахОстатки
		|ГДЕ
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток > 0";
	
	
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(УниверсальныйОтчет.ДатаКон), КонецДня(УниверсальныйОтчет.ДатаКон), Дата("39991231")));
	
	ТаблицаРезервов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из ТаблицаРезервов Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.НК) Тогда
			
			НайденныеСтроки = СтрокаТЗ.ЗаказПокупателя.Товары.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры", СтрокаТЗ.НК));
			
		Иначе
			
			НайденныеСтроки = СтрокаТЗ.ЗаказПокупателя.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТЗ.Номенклатура, СтрокаТЗ.ХарактеристикаНоменклатуры));
			
		КонецЕсли;
		
		ТипЦен = СтрокаТЗ.ТипЦен;
		Скидка = 0;
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если ТипЦен.Код = "000000001" И
				 НайденныеСтроки[0].Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ТипКомплект Тогда
				
				ТипЦен = ТипЦенМелкийОпт;
				
			КонецЕсли;
			
			Скидка = НайденныеСтроки[0].ПроцентСкидкиНаценки + НайденныеСтроки[0].ПроцентАвтоматическихСкидок;
			
		КонецЕсли;
		
		ЦенаБС = Ценообразование.ПолучитьЦенуНоменклатуры(
														  СтрокаТЗ.Номенклатура,
														  СтрокаТЗ.ХарактеристикаНоменклатуры,
														  ТипЦен,
														  СтрокаТЗ.Дата,
														  СтрокаТЗ.Единица,
														  СтрокаТЗ.Валюта,
														  СтрокаТЗ.Курс,
														  СтрокаТЗ.Кратность,
														  ,
														  СтрокаТЗ.ДоговорКонтрагента);
		
		СтрокаТЗ.СуммаБезСкидок = СтрокаТЗ.Количество * ЦенаБС;
		СтрокаТЗ.СуммаСкидки    = СтрокаТЗ.СуммаБезСкидок * Скидка / 100;
		СтрокаТЗ.Сумма          = СтрокаТЗ.СуммаБезСкидок - СтрокаТЗ.СуммаСкидки;
		
	КонецЦикла;
	
	Возврат ТаблицаРезервов;
	
КонецФункции

// Процедура установки начальных настроек отчета по метаданным регистра накопления
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса = 
	
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Проект КАК Проект,
		|	ВложенныйЗапрос.Подразделение КАК Подразделение,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.Регион КАК Регион,
		|	ВложенныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВложенныйЗапрос.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Проект) КАК ПроектПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Подразделение) КАК ПодразделениеПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Контрагент) КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регион) КАК РегионПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ДоговорКонтрагента) КАК ДоговорКонтрагентаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Номенклатура) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатурыПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ЗаказПокупателя) КАК ЗаказПокупателяПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Регистратор) КАК РегистраторПредставление,
		|	ВложенныйЗапрос.Период КАК Период,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, НЕДЕЛЯ) КАК ПериодНеделя,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕКАДА) КАК ПериодДекада,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ) КАК ПериодМесяц,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, КВАРТАЛ) КАК ПериодКвартал,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ГОД) КАК ПериодГод,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
		|	ВложенныйЗапрос.КоличествоБазовыхЕд КАК КоличествоБазовыхЕд,
		|	ВложенныйЗапрос.Стоимость КАК Стоимость,
		|	ВложенныйЗапрос.НДС КАК НДС,
		|	ВложенныйЗапрос.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ВложенныйЗапрос.СтоимостьБезСкидок КАК СтоимостьБезСкидок,
		|	ВложенныйЗапрос.СуммаСкидки КАК СуммаСкидки,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.СтоимостьБезСкидок = 0
		|			ТОГДА 0
		|		ИНАЧЕ (ВложенныйЗапрос.СтоимостьБезСкидок - ВложенныйЗапрос.Стоимость) / ВложенныйЗапрос.СтоимостьБезСкидок * 100
		|	КОНЕЦ КАК ПроцентСкидки,
		|	ВложенныйЗапрос.ОрганизацияИзготовитель КАК ОрганизацияИзготовитель
		|{ВЫБРАТЬ
		|	Организация.*,
		|	Проект.*,
		|	Подразделение.*,
		|	Контрагент.*,
		|	Регион.*,
		|	ДоговорКонтрагента.*,
		|	Номенклатура.*,
		|	ХарактеристикаНоменклатуры.*,
		|	ЗаказПокупателя.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	Количество,
		|	КоличествоЕдиницОтчетов,
		|	КоличествоБазовыхЕд,
		|	Стоимость,
		|	НДС,
		|	СтоимостьСНДС,
		|	СтоимостьБезСкидок,
		|	СуммаСкидки,
		|	ПроцентСкидки,
		|	ОрганизацияИзготовитель.*}
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		ВложенныйЗапрос.Проект КАК Проект,
		|		ВложенныйЗапрос.Подразделение КАК Подразделение,
		|		ВложенныйЗапрос.Контрагент КАК Контрагент,
		|		ВложенныйЗапрос.Регион КАК Регион,
		|		ВложенныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
		|		ВложенныйЗапрос.Регистратор КАК Регистратор,
		|		ВложенныйЗапрос.Период КАК Период,
		|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
		|		СУММА(ВложенныйЗапрос.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
		|		СУММА(ВложенныйЗапрос.КоличествоБазовыхЕд) КАК КоличествоБазовыхЕд,
		|		СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
		|		СУММА(ВложенныйЗапрос.НДС) КАК НДС,
		|		СУММА(ВложенныйЗапрос.СтоимостьСНДС) КАК СтоимостьСНДС,
		|		СУММА(ВложенныйЗапрос.СтоимостьБезСкидок) КАК СтоимостьБезСкидок,
		|		СУММА(ВложенныйЗапрос.СуммаСкидки) КАК СуммаСкидки,
		|		ВложенныйЗапрос.ОрганизацияИзготовитель КАК ОрганизацияИзготовитель
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПродажиОбороты.Организация КАК Организация,
		|			ПродажиОбороты.Проект КАК Проект,
		|			ПродажиОбороты.Подразделение КАК Подразделение,
		|			ПродажиОбороты.Контрагент КАК Контрагент,
		|			ПродажиОбороты.Контрагент.Регион КАК Регион,
		|			ПродажиОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|			ПродажиОбороты.Номенклатура КАК Номенклатура,
		|			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			ПродажиОбороты.Регистратор КАК Регистратор,
		|			ПродажиОбороты.Период КАК Период,
		|			ПродажиОбороты.КоличествоОборот КАК Количество,
		|			ПродажиОбороты.КоличествоОборот * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
		|			ПродажиОбороты.КоличествоОборот * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕд,
		|			ПродажиОбороты.СтоимостьОборот КАК Стоимость,
		|			ПродажиОбороты.НДСОборот КАК НДС,
		|			ПродажиОбороты.СтоимостьОборот + ПродажиОбороты.НДСОборот КАК СтоимостьСНДС,
		|			ПродажиОбороты.СтоимостьБезСкидокОборот КАК СтоимостьБезСкидок,
		|			ПродажиОбороты.СтоимостьБезСкидокОборот - ПродажиОбороты.СтоимостьОборот КАК СуммаСкидки,
		|			ВЫБОР
		|				КОГДА ПолучимЦвет.Цвет.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ПродажиОбороты.Номенклатура.Организация
		|				ИНАЧЕ ПолучимЦвет.Цвет.Организация
		|			КОНЕЦ КАК ОрганизацияИзготовитель
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК ПродажиОбороты
		|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ВЫБОР
		|						КОГДА НЕ цветСтар.Значение ЕСТЬ NULL
		|							ТОГДА цветСтар.Значение
		|						ИНАЧЕ ЦветПредопределенный.Значение
		|					КОНЕЦ КАК Цвет,
		|					ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ЗначенияСвойствОбъектов.Значение КАК Значение,
		|						ЗначенияСвойствОбъектов.Объект КАК Объект
		|					ИЗ
		|						РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|					ГДЕ
		|						ЗначенияСвойствОбъектов.Свойство.Код = ""000000069"") КАК ЦветПредопределенный
		|						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								ЗначенияСвойствОбъектов.Значение КАК Значение,
		|								ЗначенияСвойствОбъектов.Объект КАК Объект
		|							ИЗ
		|								РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|							ГДЕ
		|								ЗначенияСвойствОбъектов.Свойство.Код = ""000000072"") КАК цветСтар
		|							ПО (цветСтар.Объект = ХарактеристикиНоменклатуры.Ссылка)
		|						ПО ЦветПредопределенный.Объект = ХарактеристикиНоменклатуры.Ссылка) КАК ПолучимЦвет
		|				ПО ПродажиОбороты.ХарактеристикаНоменклатуры = ПолучимЦвет.Характеристика
		|		ГДЕ
		|			(ПродажиОбороты.КоличествоОборот <> 0
		|					ИЛИ ПродажиОбороты.СтоимостьОборот <> 0)
		|			И ВЫБОР
		|					КОГДА &Режим = 0
		|						ТОГДА ПродажиОбороты.ДокументПродажи.Контрагент.Код <> ""000009930""
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ТоварыВРезервеНаСкладах.ДокументРезерва.ДоговорКонтрагента.Организация,
		|			ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка),
		|			ТоварыВРезервеНаСкладах.ДокументРезерва.Подразделение,
		|			ТоварыВРезервеНаСкладах.ДокументРезерва.ДоговорКонтрагента.Владелец,
		|			ТоварыВРезервеНаСкладах.ДокументРезерва.ДоговорКонтрагента.Владелец.Регион,
		|			ТоварыВРезервеНаСкладах.ДокументРезерва.ДоговорКонтрагента,
		|			ТоварыВРезервеНаСкладах.Номенклатура,
		|			ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры,
		|			ТоварыВРезервеНаСкладах.ДокументРезерва,
		|			ТоварыВРезервеНаСкладах.ДокументРезерва,
		|			ТоварыВРезервеНаСкладах.ДокументРезерва.Дата,
		|			ТоварыВРезервеНаСкладах.КоличествоОстаток,
		|			ТоварыВРезервеНаСкладах.КоличествоОстаток * ЕСТЬNULL(ТоварыВРезервеНаСкладах.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ТоварыВРезервеНаСкладах.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1),
		|			ТоварыВРезервеНаСкладах.КоличествоОстаток * ЕСТЬNULL(ТоварыВРезервеНаСкладах.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1),
		|			ТоварыВРезервеНаСкладах.КоличествоОстаток * ПолучимЦену.Цена,
		|			0,
		|			ТоварыВРезервеНаСкладах.КоличествоОстаток * ПолучимЦену.Цена,
		|			ТоварыВРезервеНаСкладах.КоличествоОстаток * ПолучимЦену.Цена,
		|			ТоварыВРезервеНаСкладах.КоличествоОстаток * ПолучимЦену.Цена - ТоварыВРезервеНаСкладах.КоличествоОстаток * ПолучимЦену.Цена,
		|			ВЫБОР
		|				КОГДА ПолучимЦвет.Цвет.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ТоварыВРезервеНаСкладах.Номенклатура.Организация
		|				ИНАЧЕ ПолучимЦвет.Цвет.Организация
		|			КОНЕЦ
		|		ИЗ
		|			РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаКон, ) КАК ТоварыВРезервеНаСкладах
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|					ВЫБОР
		|						КОГДА ЗаказПокупателяТовары.Номенклатура.ВидНоменклатуры.Код <> ""000000001""
		|							ТОГДА ЗаказПокупателяТовары.Сумма / (ПолучимКолВоКомплектующий.Количество * ЗаказПокупателяТовары.Количество)
		|						ИНАЧЕ ЗаказПокупателяТовары.Сумма / ЗаказПокупателяТовары.Количество
		|					КОНЕЦ КАК Цена,
		|					ЗаказПокупателяТовары.Ссылка.Номер КАК Номер
		|				ИЗ
		|					Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							ЕСТЬNULL(СУММА(КомплектующиеНоменклатуры.Количество), 1) КАК Количество,
		|							КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|						ИЗ
		|							РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
		|						
		|						СГРУППИРОВАТЬ ПО
		|							КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры) КАК ПолучимКолВоКомплектующий
		|						ПО (ПолучимКолВоКомплектующий.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры)) КАК ПолучимЦену
		|				ПО (ВЫБОР
		|						КОГДА ТоварыВРезервеНаСкладах.НК = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|							ТОГДА ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ПолучимЦену.ХарактеристикаНоменклатуры
		|						ИНАЧЕ ПолучимЦену.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладах.НК
		|					КОНЕЦ)
		|					И ТоварыВРезервеНаСкладах.ДокументРезерва.Номер = ПолучимЦену.Номер
		|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ВЫБОР
		|						КОГДА НЕ цветСтар.Значение ЕСТЬ NULL
		|							ТОГДА цветСтар.Значение
		|						ИНАЧЕ ЦветПредопределенный.Значение
		|					КОНЕЦ КАК Цвет,
		|					ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ЗначенияСвойствОбъектов.Значение КАК Значение,
		|						ЗначенияСвойствОбъектов.Объект КАК Объект
		|					ИЗ
		|						РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|					ГДЕ
		|						ЗначенияСвойствОбъектов.Свойство.Код = ""000000069"") КАК ЦветПредопределенный
		|						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								ЗначенияСвойствОбъектов.Значение КАК Значение,
		|								ЗначенияСвойствОбъектов.Объект КАК Объект
		|							ИЗ
		|								РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|							ГДЕ
		|								ЗначенияСвойствОбъектов.Свойство.Код = ""000000072"") КАК цветСтар
		|							ПО (цветСтар.Объект = ХарактеристикиНоменклатуры.Ссылка)
		|						ПО ЦветПредопределенный.Объект = ХарактеристикиНоменклатуры.Ссылка) КАК ПолучимЦвет
		|				ПО ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ПолучимЦвет.Характеристика
		|		ГДЕ
		|			&Режим = 2
		|			И ТоварыВРезервеНаСкладах.ДокументРезерва.Проведен
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ОтчетПроизводстваЗаСменуПродукция.Номенклатура,
		|			ОтчетПроизводстваЗаСменуПродукция.ХарактеристикаНоменклатуры,
		|			NULL,
		|			ОтчетПроизводстваЗаСменуПродукция.Ссылка,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ОтчетПроизводстваЗаСменуПродукция.Количество,
		|			ОтчетПроизводстваЗаСменуПродукция.СуммаПлановая,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ВЫБОР
		|				КОГДА ПолучимЦвет.Цвет.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ОтчетПроизводстваЗаСменуПродукция.Номенклатура.Организация
		|				ИНАЧЕ ПолучимЦвет.Цвет.Организация
		|			КОНЕЦ
		|		ИЗ
		|			Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ОтчетПроизводстваЗаСменуПродукция
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ВЫБОР
		|						КОГДА НЕ цветСтар.Значение ЕСТЬ NULL
		|							ТОГДА цветСтар.Значение
		|						ИНАЧЕ ЦветПредопределенный.Значение
		|					КОНЕЦ КАК Цвет,
		|					ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ЗначенияСвойствОбъектов.Значение КАК Значение,
		|						ЗначенияСвойствОбъектов.Объект КАК Объект
		|					ИЗ
		|						РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|					ГДЕ
		|						ЗначенияСвойствОбъектов.Свойство.Код = ""000000069"") КАК ЦветПредопределенный
		|						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								ЗначенияСвойствОбъектов.Значение КАК Значение,
		|								ЗначенияСвойствОбъектов.Объект КАК Объект
		|							ИЗ
		|								РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|							ГДЕ
		|								ЗначенияСвойствОбъектов.Свойство.Код = ""000000072"") КАК цветСтар
		|							ПО (цветСтар.Объект = ХарактеристикиНоменклатуры.Ссылка)
		|						ПО ЦветПредопределенный.Объект = ХарактеристикиНоменклатуры.Ссылка) КАК ПолучимЦвет
		|				ПО ОтчетПроизводстваЗаСменуПродукция.ХарактеристикаНоменклатуры = ПолучимЦвет.Характеристика
		|		ГДЕ
		|			(&Режим = 1
		|					ИЛИ &Режим = 2)
		|			И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Проведен
		|			И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата >= &ДатаНачала
		|			И ОтчетПроизводстваЗаСменуПродукция.Ссылка.Дата <= &ДатаКонца
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПоступлениеТоваровУслугТовары.Ссылка.Организация,
		|			NULL,
		|			NULL,
		|			ПоступлениеТоваровУслугТовары.Ссылка.Контрагент,
		|			NULL,
		|			ПоступлениеТоваровУслугТовары.Ссылка.ДоговорКонтрагента,
		|			ПоступлениеТоваровУслугТовары.Номенклатура,
		|			ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры,
		|			NULL,
		|			ПоступлениеТоваровУслугТовары.Ссылка,
		|			NULL,
		|			NULL,
		|			NULL,
		|			-ПоступлениеТоваровУслугТовары.Количество,
		|			-ПоступлениеТоваровУслугТовары.Сумма,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ВЫБОР
		|				КОГДА ПолучимЦвет.Цвет.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА ПоступлениеТоваровУслугТовары.Номенклатура.Организация
		|				ИНАЧЕ ПолучимЦвет.Цвет.Организация
		|			КОНЕЦ
		|		ИЗ
		|			Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ВЫБОР
		|						КОГДА НЕ цветСтар.Значение ЕСТЬ NULL
		|							ТОГДА цветСтар.Значение
		|						ИНАЧЕ ЦветПредопределенный.Значение
		|					КОНЕЦ КАК Цвет,
		|					ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|				ИЗ
		|					(ВЫБРАТЬ
		|						ЗначенияСвойствОбъектов.Значение КАК Значение,
		|						ЗначенияСвойствОбъектов.Объект КАК Объект
		|					ИЗ
		|						РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|					ГДЕ
		|						ЗначенияСвойствОбъектов.Свойство.Код = ""000000069"") КАК ЦветПредопределенный
		|						ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|							ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								ЗначенияСвойствОбъектов.Значение КАК Значение,
		|								ЗначенияСвойствОбъектов.Объект КАК Объект
		|							ИЗ
		|								РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|							ГДЕ
		|								ЗначенияСвойствОбъектов.Свойство.Код = ""000000072"") КАК цветСтар
		|							ПО (цветСтар.Объект = ХарактеристикиНоменклатуры.Ссылка)
		|						ПО ЦветПредопределенный.Объект = ХарактеристикиНоменклатуры.Ссылка) КАК ПолучимЦвет
		|				ПО ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры = ПолучимЦвет.Характеристика
		|		ГДЕ
		|			(&Режим = 1
		|					ИЛИ &Режим = 2)
		|			И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
		|			И ПоступлениеТоваровУслугТовары.Ссылка.Дата >= &ДатаНачала
		|			И ПоступлениеТоваровУслугТовары.Ссылка.Дата <= &ДатаКонца) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация,
		|		ВложенныйЗапрос.Проект,
		|		ВложенныйЗапрос.Подразделение,
		|		ВложенныйЗапрос.Контрагент,
		|		ВложенныйЗапрос.Регион,
		|		ВложенныйЗапрос.ДоговорКонтрагента,
		|		ВложенныйЗапрос.Номенклатура,
		|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		|		ВложенныйЗапрос.ЗаказПокупателя,
		|		ВложенныйЗапрос.Регистратор,
		|		ВложенныйЗапрос.Период,
		|		ВложенныйЗапрос.ОрганизацияИзготовитель) КАК ВложенныйЗапрос
		|{ГДЕ
		|	ВложенныйЗапрос.Организация.*,
		|	ВложенныйЗапрос.Проект.*,
		|	ВложенныйЗапрос.Подразделение.*,
		|	ВложенныйЗапрос.Контрагент.*,
		|	ВложенныйЗапрос.Регион.*,
		|	ВложенныйЗапрос.ДоговорКонтрагента.*,
		|	ВложенныйЗапрос.Номенклатура.*,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.*,
		|	ВложенныйЗапрос.ЗаказПокупателя.*,
		|	ВложенныйЗапрос.Регистратор.*,
		|	ВложенныйЗапрос.Период,
		|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ)) КАК ПериодДень,
		|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, НЕДЕЛЯ)) КАК ПериодНеделя,
		|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕКАДА)) КАК ПериодДекада,
		|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ)) КАК ПериодМесяц,
		|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, КВАРТАЛ)) КАК ПериодКвартал,
		|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
		|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ГОД)) КАК ПериодГод,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.КоличествоЕдиницОтчетов,
		|	ВложенныйЗапрос.КоличествоБазовыхЕд,
		|	ВложенныйЗапрос.Стоимость,
		|	ВложенныйЗапрос.НДС,
		|	ВложенныйЗапрос.СтоимостьСНДС,
		|	ВложенныйЗапрос.СтоимостьБезСкидок,
		|	ВложенныйЗапрос.СуммаСкидки,
		|	(ВЫБОР
		|			КОГДА ВложенныйЗапрос.СтоимостьБезСкидок = 0
		|				ТОГДА 0
		|			ИНАЧЕ (ВложенныйЗапрос.СтоимостьБезСкидок - ВложенныйЗапрос.Стоимость) / ВложенныйЗапрос.СтоимостьБезСкидок * 100
		|		КОНЕЦ) КАК ПроцентСкидки,
		|	ВложенныйЗапрос.ОрганизацияИзготовитель.*}
		|{УПОРЯДОЧИТЬ ПО
		|	Организация.*,
		|	Проект.*,
		|	Подразделение.*,
		|	Контрагент.*,
		|	Регион.*,
		|	ДоговорКонтрагента.*,
		|	Номенклатура.*,
		|	ХарактеристикаНоменклатуры.*,
		|	ЗаказПокупателя.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	Количество,
		|	КоличествоЕдиницОтчетов,
		|	КоличествоБазовыхЕд,
		|	Стоимость,
		|	НДС,
		|	СтоимостьСНДС,
		|	СтоимостьБезСкидок,
		|	СуммаСкидки,
		|	ПроцентСкидки,
		|	ОрганизацияИзготовитель.*}
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(КоличествоЕдиницОтчетов),
		|	СУММА(КоличествоБазовыхЕд),
		|	СУММА(Стоимость),
		|	СУММА(НДС),
		|	СУММА(СтоимостьСНДС),
		|	СУММА(СтоимостьБезСкидок),
		|	СУММА(СуммаСкидки),
		|	ВЫБОР
		|		КОГДА СУММА(ВложенныйЗапрос.СтоимостьБезСкидок) = 0
		|			ТОГДА 0
		|		ИНАЧЕ (СУММА(ВложенныйЗапрос.СтоимостьБезСкидок) - СУММА(ВложенныйЗапрос.Стоимость)) / СУММА(ВложенныйЗапрос.СтоимостьБезСкидок) * 100
		|	КОНЕЦ КАК ПроцентСкидки
		|ПО
		|	ОБЩИЕ
		|{ИТОГИ ПО
		|	Организация.*,
		|	Проект.*,
		|	Подразделение.*,
		|	Контрагент.*,
		|	Регион.*,
		|	ДоговорКонтрагента.*,
		|	Номенклатура.*,
		|	ХарактеристикаНоменклатуры.*,
		|	ЗаказПокупателя.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	ОрганизацияИзготовитель.*}";

	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Организация"               , "Организация"               , "Организация"                , ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Организации);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Контрагент"                , "Контрагент"                , "Контрагент"                 , ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Регион"                    , "Регион"                    , "Регион"                     , ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Регионы);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ДоговорКонтрагента"        , "ДоговорКонтрагента"        , "Договор контрагента"        , ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
		УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя"           , "ЗаказПокупателя"           , "Заказ покупателя"           , ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документ_ЗаказПокупателя);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ЗаказПокупателя"           , "ЗаказПокупателя"           , "Заказ покупателя"           , ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.Номенклатура"              , "Номенклатура"              , "Номенклатура"               , ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ВложенныйЗапрос.ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры", "Характеристика номенклатуры", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ХарактеристикиНоменклатуры);
		
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация"               , "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент"                , "Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Регион"                    , "Регион");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента"        , "Договор контрагента");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗаказПокупателя"           , "Заказ покупателя");
	//УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументПродажи"           , "Документ продажи");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение"             , "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Проект"                    , "Проект");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура"              , "Номенклатура");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ХарактеристикаНоменклатуры", "Характеристика номенклатуры");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество"                , "Количество (ед. хранения)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕд"       , "Количество (в базовых единицах)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоЕдиницОтчетов"   , "Количество (в ед. отчетов)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Стоимость"                 , "Сумма продажи без НДС");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДС"                       , "НДС продажи");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьСНДС"             , "Сумма продажи (с НДС)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьБезСкидок"        , "Сумма продажи без скидок (без НДС)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаСкидки"               , "Сумма скидки");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПроцентСкидки"             , "% скидки");
	
	УниверсальныйОтчет.ДобавитьПолеГруппировка("НоменклатураБазоваяЕдиницаИзмерения", "Номенклатура", "БазоваяЕдиницаИзмерения", "Базовая единица измерения");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	ВалютаУпр = глЗначениеПеременной("ВалютаУправленческогоУчета").Наименование;
	
	УниверсальныйОтчет.ДобавитьПоказатель("Количество"              , "Количество (в ед. хранения)"                      , Ложь  , "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕд"     , "Количество (в базовых единицах)"                  , Истина, "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетов" , "Количество (в ед. отчетов)"                       , Ложь  , "ЧЦ=15; ЧДЦ=3");
	УниверсальныйОтчет.ДобавитьПоказатель("Стоимость"               , "Сумма продажи (без НДС) в "            + ВалютаУпр, Ложь  , "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("НДС"                     , "НДС продажи в "                        + ВалютаУпр, Ложь  , "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьСНДС"           , "Сумма продажи (с НДС) в "              + ВалютаУпр, Истина, "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьБезСкидок"      , "Сумма продажи без скидок (без НДС) в " + ВалютаУпр, Ложь  , "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаСкидки"             , "Сумма скидки (без НДС) в "             + ВалютаУпр, Ложь  , "ЧЦ=15; ЧДЦ=2");
	УниверсальныйОтчет.ДобавитьПоказатель("ПроцентСкидки"           , "% скидки (без НДС)"                               , Ложь  , "ЧЦ=15; ЧДЦ=2");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Покупатель");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	УниверсальныйОтчет.ДобавитьОтбор("Проект");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьПорядок("Контрагент.Наименование");
	УниверсальныйОтчет.ДобавитьПорядок("Номенклатура.Наименование");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("НоменклатураБазоваяЕдиницаИзмерения");
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Режим", ПереключательРежим);
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
